[
    {"id": 1, "name" : "Summarify – AI-Powered Summarization Tool", "description": "An AI-powered web application developed in Python and Flask that generates concise summaries from lengthy texts using Hugging Face Transformers.", "image":"/images/Summarify.jpg", "gif": "/images/Summarify.gif"},
    {"id": 2, "name" : "Hydro Squad", "description": "A dynamic platform for kitchen exhaust cleaning services in Ontario, created with Next.js, TypeScript, and Bootstrap. It features integrated Google Maps and a streamlined quote request system.", "image":"/images/CommercialKitchen.jpg", "gif": "/images/Hydro Squad.gif" },
    {"id": 3, "name" : "Smart TreadMill", "description": "An interactive interface for traditional treadmills, developed with Next.js and React, featuring virtual runs, customizable workout presets, and touchscreen navigation to enhance user engagement.", "image":"/images/Treadmills.jpg", "gif":"/images/TreadMill.gif" },
    {"id": 4, "name" : "Halifax Transit Real-Time Transit Data Fetcher", "description": "An application that leverages Halifax Transit's GTFS open data to provide real-time transit information, demonstrating effective API integration and data visualization using JavaScript.", "image": "/images/Transit.jpg", "gif": "/images/HalifaxTransit.gif"},
    {"id": 5, "name": "World Dictionary", "description": "For one of my initial projects, I developed an interactive web application using JavaScript, HTML, and CSS. This application showcases country-specific data, including population metrics and geographical details, with intuitive toggling features and seamless access to Wikipedia.", "image":"/images/Knowledge.jpg", "gif": "/images/World Dictionary.gif"},
    {"id": 6, "name": "Knowledge Nexus", "description": "Developed an online bookstore with ASP.NET and C#. Knoweldge Nexus features responsive design, user-friendly navigation, customizable options, and secure checkout for a seamless shopping experience.", "image": "/images/Bookstore.jpg", "gif": "/images/Knowledge Nexus.gif"},
    {"id": 7, "name": "IMDB Explorer", "description": "Collaboratively developed a WPF app utilizing Entity Framework and LINQ to navigate IMDB data. This project includes multiple data views and custom filtering features with a refined UI theme.", "image": "/images/Movies.jpg", "gif": "/images/IMDB Explorer.gif"}
]