[
    {"id": 1, "name" : "MY Gallery Collection", "description": "“My Gallery Collection” is an ASP.NET web application designed for art enthusiasts and history buffs. It provides a platform for users to upload, edit, and delete images of their art pieces, effectively managing their personal art collections in a user-friendly environment. ", "image":"images/portfolio1.png" },
    {"id": 2, "name" : "Pokédex App", "description": "“Pokedex App” is an Android application, developed using Kotlin and Android Studio, that serves as a lookup guide for Pokémon characters. It fetches data from the PokéAPI, allowing users to search for Pokémon by name and view detailed information about them, including their type, abilities, stats, and more. The app provides a user-friendly interface, making it easy for Pokémon enthusiasts to navigate and explore the vast Pokémon universe.", "image":"images/pokedex.png" },
    {"id": 3, "name" : "5 Different Historical Facts", "description": "“5 Historical Facts” is a simple yet informative website created using basic HTML and CSS. The website presents an article-style layout that shares five random historical facts. Each fact is presented in a clear and concise manner, making it easy for visitors to absorb the information. The use of CSS enhances the visual appeal of the site, providing a pleasant reading experience.", "image":"images/History.png" },
    {"id": 4, "name" : "Real-time-bus transit data using API ", "description": "For this project, I decided to caption real-life transit data from Halifax Transit’s open data. This data is used by Google and other third-party developers to create apps for public use.", "image": "images/transitdata.png"},
    {"id": 5, "name": "WORLD DICTIONARY", "description": "WORLD DICTIONARY is an interactive web atlas built with JavaScript, HTML5, CSS, and JSON. It features a form on the main page for selecting countries, displaying their flags and information, with options to switch between kilometers and miles. A click on the main page leads to a Wikipedia lookup for in-depth country details. This compact webpage serves as both an educational resource and a showcase of web development skills.", "image":"images/worlddictionary.png"}
]