[
    {"id": 1, "name" : "Summarify – AI-Powered Summarization Tool", "description": "Built a Flask-based web app leveraging Hugging-Face Transformers to generate concise, meaningful text summaries. Summarify offers a customizable, intuitive interface for efficient content distillation.", "image":"public/images/AI.jpg", "gif": "public/images/Summarify.gif"},
    {"id": 2, "name" : "Hydro Squad", "description": "Created a dynamic platform for kitchen exhaust cleaning services using Next.js and TypeScript. Features include responsive design, integrated Google Maps, and a user-friendly quote request system.", "image":"public/images/Restaurant.jpg", "gif": "public/images/Hydro Squad.gif" },
    {"id": 3, "name" : "Smart TreadMill", "description": "Redesigned a tradmill interface using Next.js and React to introduce interactive features such as virtual runs and workout presets, enchancing user engagement and accessibility.", "image":"public/images/Treadmills.jpg", "gif":"public/images/TreadMill.gif" },
    {"id": 4, "name" : "Halifax Transit Real-Time Transit Data Fetcher", "description": "Developed an application that retrieves live transit data from Halifax Transit's GTFS open data feed, providing users with up-to-date public transit information.", "image": "public/images/Transit.jpg", "gif": "public/images/HalifaxTransit.gif"},
    {"id": 5, "name": "World Dictionary", "description": "For one of my initial projects, I developed an interactive web application using JavaScript, HTML, and CSS. This application showcases country-specific data, including population metrics and geographical details, with intuitive toggling features and seamless access to Wikipedia.", "image":"public/images/knowledge.jpg", "gif": "public/images/World Dictionary.gif"},
    {"id": 6, "name": "Knowledge Nexus", "description": "Developed an online bookstore with ASP.NET and C#. Knoweldge Nexus features responsive design, user-friendly navigation, customizable options, and secure checkout for a seamless shopping experience.", "image": "public/images/Bookstore.avif", "gif": "public/images/Knowledge Nexus.gif"},
    {"id": 7, "name": "IMDB Explorer", "description": "Collaboratively developed a WPF app utilizing Entity Framework and LINQ to navigate IMDB data. This project includes multiple data views and custom filtering features with a refined UI theme.", "image": "public/images/Movies.jpg", "gif": "public/images/IMDB Explorer.gif"}
]